03-Res-Latency-hotel-2profile-better/Res-firecracker-random-v1/firecracker_t_10_c_30_frontVcpu_4_wrkVcpu_1_R_1000/wrk.txt
Running 2m test @ http://frontend:5000
  10 threads and 30 connections
  Thread calibration: mean lat.: 5.102ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 4.789ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 4.888ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 4.863ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 4.835ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 5.111ms, rate sampling interval: 20ms
  Thread calibration: mean lat.: 4.955ms, rate sampling interval: 20ms
  Thread calibration: mean lat.: 5.318ms, rate sampling interval: 21ms
  Thread calibration: mean lat.: 5.187ms, rate sampling interval: 21ms
  Thread calibration: mean lat.: 5.089ms, rate sampling interval: 20ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     4.74ms    3.51ms  16.62ms   82.73%
    Req/Sec   102.55     73.50   315.00     72.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.33ms
 75.000%    6.39ms
 90.000%    9.66ms
 99.000%   16.62ms
 99.900%   23.04ms
 99.990%   28.21ms
 99.999%   33.41ms
100.000%   33.69ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.522     0.000000            1         1.00
       1.557     0.100000        11048         1.11
       2.051     0.200000        22069         1.25
       2.505     0.300000        33101         1.43
       2.859     0.400000        44136         1.67
       3.331     0.500000        55130         2.00
       3.719     0.550000        60621         2.22
       4.311     0.600000        66134         2.50
       4.991     0.650000        71656         2.86
       5.663     0.700000        77159         3.33
       6.395     0.750000        82687         4.00
       6.795     0.775000        85426         4.44
       7.219     0.800000        88188         5.00
       7.707     0.825000        90935         5.71
       8.271     0.850000        93709         6.67
       8.887     0.875000        96463         8.00
       9.247     0.887500        97833         8.89
       9.663     0.900000        99222        10.00
      10.119     0.912500       100592        11.43
      10.639     0.925000       101974        13.33
      11.191     0.937500       103334        16.00
      11.535     0.943750       104021        17.78
      11.895     0.950000       104712        20.00
      12.279     0.956250       105397        22.86
      12.743     0.962500       106096        26.67
      13.303     0.968750       106785        32.00
      13.647     0.971875       107129        35.56
      13.975     0.975000       107465        40.00
      14.351     0.978125       107807        45.71
      14.823     0.981250       108156        53.33
      15.303     0.984375       108499        64.00
      15.575     0.985938       108669        71.11
      15.927     0.987500       108841        80.00
      16.327     0.989062       109015        91.43
      16.799     0.990625       109192       106.67
      17.231     0.992188       109359       128.00
      17.503     0.992969       109447       142.22
      17.871     0.993750       109531       160.00
      18.335     0.994531       109616       182.86
      18.815     0.995313       109703       213.33
      19.343     0.996094       109790       256.00
      19.631     0.996484       109831       284.44
      19.935     0.996875       109875       320.00
      20.303     0.997266       109919       365.71
      20.735     0.997656       109960       426.67
      21.311     0.998047       110003       512.00
      21.535     0.998242       110025       568.89
      21.791     0.998437       110046       640.00
      22.143     0.998633       110068       731.43
      22.591     0.998828       110089       853.33
      23.167     0.999023       110112      1024.00
      23.359     0.999121       110124      1137.78
      23.535     0.999219       110133      1280.00
      23.759     0.999316       110143      1462.86
      24.207     0.999414       110154      1706.67
      24.687     0.999512       110166      2048.00
      24.927     0.999561       110170      2275.56
      25.295     0.999609       110175      2560.00
      25.615     0.999658       110181      2925.71
      26.079     0.999707       110186      3413.33
      26.415     0.999756       110192      4096.00
      26.607     0.999780       110194      4551.11
      27.023     0.999805       110197      5120.00
      27.183     0.999829       110200      5851.43
      27.487     0.999854       110202      6826.67
      27.887     0.999878       110205      8192.00
      28.031     0.999890       110206      9102.22
      29.167     0.999902       110208     10240.00
      29.439     0.999915       110209     11702.86
      29.647     0.999927       110210     13653.33
      29.887     0.999939       110212     16384.00
      29.887     0.999945       110212     18204.44
      30.287     0.999951       110213     20480.00
      30.943     0.999957       110214     23405.71
      30.943     0.999963       110214     27306.67
      32.303     0.999969       110215     32768.00
      32.303     0.999973       110215     36408.89
      32.319     0.999976       110216     40960.00
      32.319     0.999979       110216     46811.43
      32.319     0.999982       110216     54613.33
      33.407     0.999985       110217     65536.00
      33.407     0.999986       110217     72817.78
      33.407     0.999988       110217     81920.00
      33.407     0.999989       110217     93622.86
      33.407     0.999991       110217    109226.67
      33.695     0.999992       110218    131072.00
      33.695     1.000000       110218          inf
#[Mean    =        4.738, StdDeviation   =        3.511]
#[Max     =       33.664, Total count    =       110218]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  120141 requests in 2.00m, 49.47MB read
Requests/sec:   1001.07
Transfer/sec:    422.11KB